/*
int এর ম্যাক্সিমাম রেঞ্জ হলো -2,147,483,648 to 2,147,483,647 এর থেকে সংখ্যা ব্যবহার করতে হলে আমাদের long long int ব্যবহার করতে হবে।
লং লং ব্যবহার করলে আমাদের মেমোরি অনেক বেশি ইউজ হয় তাই দরকার ছাড়া লং লং না উইস করাই ভালো, এবং বেশি কার্যকরি।
*/  

#include <stdio.h>

int main() {
    int ar[] = {9, 2, 2, 3, 3, 1, 2, 9, 5, 0, 9, 9, 9, 9, 1, 2, 2, 2};
    int len_ar = sizeof(ar) / sizeof(ar[0]);

    int fr[10] = {0};

    for (int i = 0; i < len_ar; i++) {
        fr[ar[i]]++;
    }

    for (int i = 0; i < 10; i++) {
        if (fr[i] != 0) {
            printf("%d -> %d\n", i, fr[i]);
        }
    }
}